Autodesk.Revit.DB.Macros.MacroEnvironment
The Macro environments.
Since:
2014
Since:
2014

Autodesk.Revit.DB.Macros.MacroEnvironment.UI
The UI environment.

Autodesk.Revit.DB.Macros.MacroEnvironment.DB
The DB environment.